{
  "profile": {
    "name": "Aaron YingCai Sun",
    "title": "Senior Software Engineer at Klarna",
    "location": "Stockholm, Sweden",
    "image": "profile.jpg",
    "social": {
      "github": "https://github.com/aaronsuns",
      "linkedin": "https://www.linkedin.com/in/aaron-yingcai-sun-6658b83",
      "email": "mailto:aaronsuns@gmail.com"
    }
  },
  "about": [
    "Senior Software Engineer with 20+ years of experience building and scaling distributed systems, cloud platforms, and large-scale service-oriented architectures. At Klarna, I'm part of a team designing and operating bank-grade cloud deployment platforms that power mission-critical financial services for over 150 engineering teams. We manage centralized AWS infrastructure supporting hundreds of microservices and thousands of ECS tasks across all environments.",
    "Expert in programming languages (Go, TypeScript, Python, C#, Perl) and cloud-native technologies including AWS (ECS, Lambda, Step Functions, EC2, RDS, VPC, Route53, S3, SQS, DynamoDB, ASG, CDK, CloudFormation), Kubernetes (OpenShift, ArgoCD with operator development experience), Docker, and infrastructure automation (Ansible, Terraform). Extensive experience with databases (PostgreSQL, MySQL, Oracle, DB2, DynamoDB, Solr), message queues (ActiveMQ, SQS), and full-stack development including Vue.js.",
    "Proven track record in system architecture design, performance optimization, capacity planning, and troubleshooting complex distributed systems. Successfully managed large-scale R&D and test server infrastructure, both on-premise and cloud-based. Experienced in high-availability testing, server performance analysis, and supporting customer deployments.",
    "Strong technical leader with experience mentoring engineers, leading cross-functional teams, and driving technical initiatives. Former QA team lead with extensive background in large-scale test automation, CI/CD pipeline setup (Jenkins, GitLab, Git/Gerrit), and systematic testing of enterprise-grade systems. Experience managing infrastructure for development teams and enabling smooth deployment workflows with green/blue and canary strategies.",
    "Passionate about automation, AI/ML technologies, and process efficiency. Implemented AI-powered search solutions using natural language processing and fuzzy matching. Keen interest in emerging technologies including Generative AI, LLM integration, and agentic systems. Firm believer in keeping things simple (Unix/Linux philosophy) and maintaining high quality in all work. Strong advocate for best practices in infrastructure as code, observability, and DevOps culture."
  ],
  "experience": [
    {
      "title": "Senior Software Engineer | Code-to-Cloud Platform Team",
      "company": "Klarna",
      "companyUrl": "https://www.klarna.com/",
      "period": "October 2024 - Present",
      "location": "Stockholm, Sweden",
      "description": "Klarna Engineering Platform (KEP) Domain - Code-to-Cloud is part of Klarna Engineering Platform, providing a common, stable platform for Klarna services.",
      "bullets": [
        "Managed centralized cloud deployment platform for most of Klarna's services, ensuring secure, stable, cost-efficient operations",
        "Designed and maintained bank-grade applications with auto-scaling and high availability for production workloads",
        "Built and maintained AWS automation platform enabling Klarna engineers to manage service deployments, scaling, networking, certificates, and secrets across dev, staging, performance, and production environments, including upgrade and deployment workflows with green/blue and canary promotion strategies",
        "Migrated client code from TypeScript to Go to improve performance and maintainability",
        "Led migration of Jenkins jobs for ECS sidecar upgrades and ECS daemon service update workflow to AWS Code Pipeline, modernizing CI/CD workflows and deployment automation",
        "Monitored and maintained infrastructure metrics monitoring systems, troubleshooting issues and making incremental improvements",
        "Participated in go-to person rotation and on-call activities, providing 24/7 support for critical infrastructure and ensuring high availability"
      ],
      "technologies": "TypeScript, Go, AWS ECS, AWS Step Functions, AWS Lambda, AWS Code Pipeline, Jenkins"
    },
    {
      "title": "Senior Software Engineer",
      "company": "Telness Tech",
      "companyUrl": "https://telnesstech.com/",
      "period": "August 2024 - October 2024",
      "location": "Stockholm, Sweden",
      "description": "Golang developer at payment team. Integrated Telness's system with Stripe API for billing. The automated digital telco enabler.",
      "technologies": "Go, GraphQL, Event Sourcing, AWS"
    },
    {
      "title": "Senior Software Engineer",
      "company": "Vizrt",
      "companyUrl": "https://www.vizrt.com/",
      "period": "December 2018 - July 2024",
      "location": "Stockholm, Sweden",
      "bullets": [
        "Developed and maintained Media Asset Management system, a modular and distributed system, and participated in modernization efforts using Kubernetes and ArgoCD (GitOps)",
        "Worked on search subsystem, including Solr indexing and complex query implementation for search results",
        "Refactored search subsystem code extensively, significantly improving performance and stability while reducing CPU and memory usage",
        "Implemented AI search POC in Python with fuzzy search capabilities using human-readable words for videos, enabling direct navigation to specific video positions, demonstrated at an exhibition",
        "Developed customer-specific projects including media transfer plugins in Golang, integrating with Adobe Cloud, Endeavour, Real Madrid, and other clients",
        "Maintained system test suite with Python"
      ],
      "technologies": "Golang, Perl, Python, C#, C, C++, Kubernetes, ArgoCD, REST API, Microservices, ActiveMQ, Postgres, DB2, Oracle, Solr, Memcache, RedHat, AWS, S3, Cloud Native"
    },
    {
      "title": "QA & Release Manager",
      "company": "Connode AB",
      "companyUrl": "https://cyanconnode.com/",
      "period": "August 2012 - December 2018",
      "location": "Stockholm, Sweden",
      "description": "System test, function test, and release management of an IoT product for smart metering projects. Narrowband IoT RF mesh network using IETF 6LoWPAN (IPv6)/RPL CoAP open protocols.",
      "bullets": [
        "Responsible for test planning, test execution, test automation, and CI setup and maintenance",
        "Designed and executed large-scale performance tests",
        "Set up and automated test clusters with load balancer in AWS",
        "Conducted high availability, characteristics, and stability testing",
        "Managed development and live operations, supporting product roll-out and troubleshooting"
      ],
      "technologies": "Python, Perl, CoAP, 6LoWPAN, Java, C, RTOS, IoT, Texas Instruments Radio Chips, AWS, MongoDB"
    },
    {
      "title": "System Tester",
      "company": "Ericsson",
      "companyUrl": "https://www.ericsson.com/",
      "period": "June 2011 - August 2012",
      "location": "Stockholm, Sweden",
      "description": "System test of RBS (Radio Base Station) platform. Write/Execute test-case with Erlang CT/OTP. System test automation. Performance/Capacity/Robustness/Reliability test."
    },
    {
      "title": "TCM & Test Automation Developer",
      "company": "Ericsson",
      "companyUrl": "https://www.ericsson.com/",
      "period": "May 2008 - May 2011",
      "location": "Stockholm, Sweden",
      "description": "Test Configuration Management (TCM) of Core IMS, CSCF (SIP server). Setup test environment for function test, both real hardware and simulator. Software version control and test configuration management. Maintain Linux servers in lab. Function test automation (Perl, Linux shell). Develop test automation tools and scripts for system load test. System test."
    },
    {
      "title": "I&V Engineer / System Test Leader / Function Tester / Software Engineer",
      "company": "Ericsson",
      "companyUrl": "https://www.ericsson.com/",
      "period": "June 2003 - May 2008",
      "location": "Stockholm, Sweden | Beijing, China | Shanghai, China",
      "description": "Various roles including function test of Core IMS, CSCF (SIP server) and Media Resource Server MRF, team leadership of IPWorks system test (6 team members), and block designer/function tester of AXE core network for CDMA2000."
    }
  ],
  "projects": [
    {
      "title": "Klarna Code-to-Cloud Platform",
      "period": "October 2024 - Present",
      "description": [
        "Contributed to Klarna Engineering Platform's Code-to-Cloud (C2C) team, managing the centralized cloud deployment platform for most of Klarna's services. Worked within the existing platform structure to improve and extend features, focusing on service lifecycle management, deployments, scaling, and infrastructure monitoring.",
        "Developed automated features for AWS infrastructure management and improved platform stability and efficiency. Migrated client code from TypeScript to Go to improve performance and maintainability.",
        "Led migration of Jenkins jobs for ECS sidecar upgrades and ECS daemon service update workflow to AWS Code Pipeline, modernizing CI/CD workflows and deployment automation. Maintained and improved upgrade and deployment workflows (green/blue and canary promotion strategies), fixing bugs and implementing enhancements."
      ],
      "technologies": "TypeScript, Go, AWS ECS, AWS Step Functions, AWS Lambda, AWS Code Pipeline, Jenkins, AWS Cloud Infrastructure"
    },
    {
      "title": "Vizrt MAM Development",
      "period": "December 2018 - July 2024",
      "description": [
        "Developed and maintained Media Asset Management system, a modular and distributed system. Participated in modernization efforts using Kubernetes and ArgoCD (GitOps) to migrate from legacy infrastructure.",
        "Worked extensively on search subsystem, including Solr indexing and complex query implementation for search results. Refactored search subsystem code extensively, significantly improving performance and stability while reducing CPU and memory usage.",
        "Implemented AI search POC in Python with fuzzy search capabilities using human-readable words for videos, enabling direct navigation to specific video positions. Demonstrated at an exhibition.",
        "Developed customer-specific projects including media transfer plugins in Golang, integrating with Adobe Cloud, Endeavour, Real Madrid, and other clients. Maintained system test suite with Python."
      ],
      "technologies": "Golang, Perl, Python, C#, C, C++, Kubernetes, ArgoCD, REST API, Microservices, ActiveMQ, Postgres, DB2, Oracle, Solr, Memcache, RedHat, AWS, S3, Cloud Native"
    },
    {
      "title": "Connode Solution Test",
      "period": "August 2012 - December 2018",
      "description": [
        "System test, function test, and release management of an IoT product for smart metering projects. Narrowband IoT RF mesh network using IETF 6LoWPAN (IPv6)/RPL CoAP open protocols.",
        "Responsible for test planning, test execution, test automation, and CI setup and maintenance. Designed and executed large-scale performance tests.",
        "Set up and automated test clusters with load balancer in AWS. Conducted high availability, characteristics, and stability testing. Setup continuous integration for both server and node side, created and maintained smoke tests and daily regression test scripts."
      ],
      "technologies": "Python, Perl, CoAP, 6LoWPAN, Java, C, RTOS, IoT, Texas Instruments Radio Chips, AWS, MongoDB"
    },
    {
      "title": "RBS Platform System Test",
      "period": "May 2011 - June 2012",
      "description": [
        "System test of RBS (Radio Base Station) platform. Agile/Scrum way of working. Mainly used Erlang/OTP/CT for test automation. All test-cases written in Erlang with Common Test framework. Also used Perl/Linux shell scripts as helpers. Performed integration and system tests for different types of RBS platform, for WCDMA/LTE, multi-standard RBS etc."
      ],
      "technologies": "Erlang, OTP, CT, Perl, Linux Shell"
    },
    {
      "title": "CSCF Test Environment Setup and Test Automation",
      "period": "May 2008 - May 2011",
      "description": [
        "Setup and maintained test environment for Core IMS, CSCF (SIP server). Used Perl and Linux shell scripts to create convenient work environment for testers. Ensured all servers were in healthy condition. Involved with MAIA sub-project - simulation of telecom server platform (TSP), responsible for integration to R&D development/test environment using VMware/Virtualbox, Soft-IP-routing (ospfd, zebra, openVPN), serving 20+ developers/testers."
      ],
      "technologies": "Perl, Linux Shell, VMware, Virtualbox, ClearCase, Subversion"
    },
    {
      "title": "CSCF Test Automation and Regression Test",
      "period": "July 2007 - May 2008",
      "description": [
        "Troubleshooting failed test-cases, corrected errors in test-cases, wrote trouble reports if faults were found in CSCF. Test-case automation and maintained daily runs. Ensured all legacy functions were not broken when new CSCF releases were delivered. Managed around 6000 test-cases running every day."
      ]
    },
    {
      "title": "IPworks Development",
      "period": "January 2007 - August 2007",
      "description": [
        "IPworks mainly works as DNS/DHCP servers. Supports internal/external DNS, ACL, A/SRV/ENUM records, Dynamic DNS. Also has functions for ERH (External Resource handler) and SS7. MySQL cluster used for back-end data management. One of the key components of the whole IMS architecture. Agile/Scrum way of working."
      ],
      "technologies": "MySQL Cluster, DNS, DHCP"
    },
    {
      "title": "CSCF/MRF Development",
      "period": "January 2006 - December 2006",
      "description": [
        "Developed test-cases in Spirent (Protocol testing tool), function test of CSCF/MRF, working with protocols like SIP, diameter, LDAP, TCP/UDP etc, IP networking. Tested several features including system counter accuracy, Lawful Intercept, Number Portability, Third party registration etc."
      ],
      "technologies": "Spirent, SIP, Diameter, LDAP, TCP/UDP"
    },
    {
      "title": "CDMA 2000 Development",
      "period": "June 2003 - December 2005",
      "description": [
        "AXE platform block design and function test, using Ericsson PLEX-C/ASA assembler language. FOA (Install First Official Application) in customer site."
      ],
      "technologies": "PLEX-C, ASA Assembler"
    }
  ],
  "skills": [
    {
      "category": "Programming Languages",
      "items": "Go, TypeScript, Python, C#, Perl, Java, C/C++, Erlang"
    },
    {
      "category": "Cloud & Infrastructure",
      "items": "AWS (ECS, Lambda, Step Functions, EC2, RDS, VPC, Route53, S3, SQS, DynamoDB, ASG, CDK, CloudFormation, Code Pipeline), Kubernetes (OpenShift, ArgoCD), Docker, Ansible, Terraform"
    },
    {
      "category": "Databases",
      "items": "PostgreSQL, MySQL, Oracle, DB2, DynamoDB, Solr, MongoDB"
    },
    {
      "category": "Tools & Practices",
      "items": "Git, GitLab, Gerrit, Jenkins, CI/CD, Infrastructure as Code, VMWare ESXi, Container (Docker/LXD)"
    },
    {
      "category": "AI/ML Technologies",
      "items": "AI/ML Development, Natural Language Processing, Fuzzy Search, Prompt Engineering, LLM Integration, Agentic AI"
    },
    {
      "category": "Other Technologies",
      "items": "REST API, GraphQL, Microservices, Event Sourcing, ActiveMQ, Memcache, Vue.js, CoAP, 6LoWPAN, RTOS, IoT, Linux System Administration"
    }
  ],
  "education": [
    {
      "degree": "Bachelor of Science (BS), Computer Software Engineering",
      "school": "Southeast University",
      "period": "2000 - 2004"
    }
  ],
  "contact": {
    "email": "aaronsuns@gmail.com",
    "location": "Vasagatan 15A, 17261, Sundbyberg, Sweden",
    "phone": "+46734123402",
    "linkedin": "https://www.linkedin.com/in/aaron-yingcai-sun-6658b83",
    "website": "https://aaronsuns.github.io/"
  }
}

